Core/src/src/Documents/СчетФактураОтправленныйГрузия/СчетФактураОтправленныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураОтправленныйГрузия</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.АвансыОтправленныхФактур</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировочная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаКорректировки</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеКорректировки</name>
    <type>
      <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.АктВыполненныхРабот</types>
        <types>DocumentRef.ЧекККМ</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.Взаимозачет</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПоступлениеВКассу</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПоступлениеНаСчет</types>
        <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПодарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОтчетКомитенту</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Documents/СчетФактураОтправленныйГрузия/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполненияЛок(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		КоличествоДокументов = ДанныеЗаполнения.Количество();
		Контрагент = ДанныеЗаполнения[0].Контрагент;
		
		Для Каждого ДокументСсылка Из ДанныеЗаполнения Цикл
			Если Не ДокументСсылка.Контрагент = Контрагент Тогда
				Сообщить(НСТР("ka = ""კონტრაგენტები განსხვავდებიან ერთმანეთისგან"";  ru = ""კონტრაგენტები განსხვავდებიან ერთმანეთისგან"";"));
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументСсылка.Организация) Тогда
				Сообщить(НСТР("ka = ""შევსებული არ არის ორგანიზაციის ველი დოკუმენტში: ""; ru = ""შევსებული არ არის ორგანიზაციის ველი დოკუმენტში: ""; ") + ДокументСсылка);	
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументСсылка.Контрагент) Тогда
				Сообщить(НСТР("ka = ""შევსებული არ არის კონტრაგენტის ველი დოკუმენტში: ""; ru = ""შევსებული არ არის კონტრაგენტის ველი დოკუმენტში: ""; ") + ДокументСсылка);	
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		ОбработкаПроверкиЗаполненияЛок(ДанныеЗаполнения, СтандартнаяОбработка);
		ЗаполнитьШапкуДокумента(ДанныеЗаполнения);
		//Паганини#OneSoft_
		Если ДанныеЗаполнения.Количество() > 0 И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			Корректировочная					= Истина;
			ПричинаКорректировки				= Перечисления.ПричиныКорректировкиСФ.ИзмененаСуммаОперации;
			ОснованиеКорректировки				= НайтиФактуруПоНакладной(ДанныеЗаполнения[0].ДокументОснование);
			ЗаполнитьИзКорректировкиРеализации(ДанныеЗаполнения);
		ИначеЕсли ДанныеЗаполнения.Количество() > 0 И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			Корректировочная					= Истина;
			ПричинаКорректировки				= Перечисления.ПричиныКорректировкиСФ.ВозвратТовара;
			ОснованиеКорректировки				= НайтиФактуруПоНакладной(ДанныеЗаполнения[0].ДокументОснование);
			ЗаполнитьИзПриходнаяНакладная(ДанныеЗаполнения);
		Иначе
		//_Паганини#OneSoft
		ЗаполнитьЗапасы(ДанныеЗаполнения);
		//Паганини#OneSoft_
	    КонецЕсли;
		//_Паганини#OneSoft
	Иначе
		ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Паганини_
	//СуммаДокумента = Запасы.Итог("Всего");
	//СуммаНДС = Запасы.Итог("СуммаНДС");
	Если Аванс Тогда
		ДокументыОснования.Очистить();
		Запасы.Очистить();
		СуммаДокумента	= ДокументыПлатежа.Итог("Сумма");
		СуммаНДС 		= ДокументыПлатежа.Итог("СуммаНДС");
	Иначе
		СуммаДокумента	= 0;
		СуммаНДС 		= 0;
		Для Каждого СтрокаТЧ ИЗ ДокументыОснования Цикл
			//Если НЕ ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда//Паганини#OneSoft
				СуммаДокумента 		= СуммаДокумента	+ СтрокаТЧ.СуммаДокумента;
				СуммаНДС 			= СуммаНДС 			+ СтрокаТЧ.СуммаНДС;
			//КонецЕсли;//Паганини#OneSoft
		КонецЦикла;
		ДокументыПлатежа.Очистить();
	КонецЕсли;
	
	Если ДокументыОснования.Количество() > 0 И (ТипЗнч(ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") ИЛИ ТипЗнч(ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
		ЗаписыватьДокумент = Ложь;
		Док = ДокументыОснования[0].ДокументОснование;
		Если НЕ Идентификатор = Док.IDСФ Тогда
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
		Если НЕ НомерВходящегоДокумента = Док.НомерСФ Тогда
			ЗаписыватьДокумент = Истина;
		КонецЕсли;
		Если ЗаписыватьДокумент Тогда
			ДокументОбъект = Док.ПолучитьОбъект();
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			ДокументОбъект.НомерСФ = НомерВходящегоДокумента;
			ДокументОбъект.IDСФ	= Формат(Идентификатор, "ЧН=' '; ЧГ=0");
			ДокументОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Заполняет шапку документа из данных заполнения
// 
// Параметры:
//	ДанныеЗаполнения - Массив - Заданные данные заполнения
//	
// Возвращаемое значение:
//	
//	
Процедура ЗаполнитьШапкуДокумента(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Документ = ДанныеЗаполнения[0];
		Автор					= ПараметрыСеанса.ТекущийПользователь;
		Контрагент				= Документ.Контрагент;
		Договор					= Документ.Договор;
		Организация 			= Документ.Организация;
		ДатаВходящегоДокумента	= Документ.Дата;
		
		Для Каждого ДокументСсылка Из ДанныеЗаполнения Цикл
			НоваяСтрока = ДокументыОснования.Добавить();
			НоваяСтрока.ДокументОснование	= ДокументСсылка.Ссылка;
			НоваяСтрока.Всего = ДокументСсылка.Запасы.Итог("Всего") + ?(ТипЗнч(НоваяСтрока.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"), ДокументСсылка.Работы.Итог("Всего"), 	0);
			НоваяСтрока.СуммаНДС = ДокументСсылка.Запасы.Итог("СуммаНДС") + ?(ТипЗнч(НоваяСтрока.ДокументОснование) = Тип("ДокументСсылка.ЗаказПокупателя"), ДокументСсылка.Работы.Итог("СуммаНДС"),	0);
			НоваяСтрока.СуммаДокумента = НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
		//+++ Lazare_09.06.2021
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная")
				И ДокументСсылка.СтоимостьДоставки > 0 Тогда 
				НоваяСтрока.Всего	 = НоваяСтрока.Всего + ДокументСсылка.СтоимостьДоставки ;
				НоваяСтрока.СуммаНДС = НоваяСтрока.СуммаНДС + ДокументСсылка.СуммаНДСДоставки ;
				НоваяСтрока.СуммаДокумента = НоваяСтрока.СуммаДокумента +(ДокументСсылка.СтоимостьДоставки - ДокументСсылка.СуммаНДСДоставки);
		КонецЕсли;			
		//--- Lazare_09.06.2021	
			
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет запасы документа из данных заполнения
// 
// Параметры:
//	ДанныеЗаполнения - Массив - Заданные данные заполнения
//	
// Возвращаемое значение:
//	
//	
Процедура ЗаполнитьЗапасы(ДанныеЗаполнения) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		КЧ = Новый КвалификаторыЧисла(12,3);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Число"));
		ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , КЧ);
		
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.Номенклатура"));
		ОписаниеТиповН = Новый ОписаниеТипов(Массив, , ,);
		
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ОписаниеТиповХ = Новый ОписаниеТипов(Массив, , ,);
		
		Массив.Очистить();
		Массив.Добавить(Тип("СправочникСсылка.ЕдиницыИзмерения"));
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"));
		ОписаниеТиповЕИ = Новый ОписаниеТипов(Массив, , ,);
		
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("Номенклатура", ОписаниеТиповН);
		Таблица.Колонки.Добавить("Характеристика", ОписаниеТиповХ);
		Таблица.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТиповЕИ);
		Таблица.Колонки.Добавить("Количество", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Цена", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Сумма", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
		Таблица.Колонки.Добавить("СуммаНДС", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Всего", ОписаниеТиповЧ);
		Таблица.Колонки.Добавить("Вид", ОписаниеТиповЧ);
		//+++ Lazare_09.06.2021
		ДанныеДоставки = Новый ТаблицаЗначений;
		ДанныеДоставки.Колонки.Добавить("Номенклатура", ОписаниеТиповН);
		ДанныеДоставки.Колонки.Добавить("ЕдиницаИзмерения", ОписаниеТиповЕИ);
		ДанныеДоставки.Колонки.Добавить("Количество", ОписаниеТиповЧ);
		ДанныеДоставки.Колонки.Добавить("Цена", ОписаниеТиповЧ);
		ДанныеДоставки.Колонки.Добавить("Сумма", ОписаниеТиповЧ);	
		ДанныеДоставки.Колонки.Добавить("СтавкаНДС",Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС")); 
		ДанныеДоставки.Колонки.Добавить("СуммаНДС", ОписаниеТиповЧ);
		ДанныеДоставки.Колонки.Добавить("Всего", ОписаниеТиповЧ);
		//--- Lazare_09.06.2021
		
		
		Для Каждого ДокументСсылка Из ДанныеЗаполнения Цикл
			Если ДокументСсылка.Курс = 1 ИЛИ ДокументСсылка.Курс = 0 Тогда//Паганини
				Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
					Для Каждого ТЗ Из ДокументСсылка.Запасы Цикл
						НоваяСтрока = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);			
						Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
							НоваяСтрока.Вид = -1; 
						Иначе
							НоваяСтрока.Вид = 1;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					Для Каждого ТЗ Из ДокументСсылка.Работы Цикл
						НоваяСтрока = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);			
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
						НоваяСтрока.Вид = 1;
					КонецЦикла;
				КонецЕсли;
				
				Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
					Для Каждого ТЗ Из ДокументСсылка.РаботыИУслуги Цикл
						НоваяСтрока = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);			
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
						НоваяСтрока.Вид = 1;
					КонецЦикла;
				КонецЕсли;
				//+++ Lazare_09.06.2021
				Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") 
					и ЗначениеЗаполнено(ДокументСсылка.НоменклатураДоставки) Тогда					
					НоваяСтрокаД = ДанныеДоставки.Добавить();
					НоваяСтрокаД.Номенклатура 	 = ДокументСсылка.НоменклатураДоставки;	
					НоваяСтрокаД.ЕдиницаИзмерения= ДокументСсылка.НоменклатураДоставки.ЕдиницаИзмерения;
					НоваяСтрокаД.Количество 	 = 1;
					НоваяСтрокаД.Цена 			 = ДокументСсылка.СтоимостьДоставки;
					НоваяСтрокаД.Сумма 			 = ДокументСсылка.СтоимостьДоставки - ДокументСсылка.СуммаНДСДоставки ;					
					НоваяСтрокаД.СтавкаНДС		 = ДокументСсылка.СтавкаНДСДоставки;
					НоваяСтрокаД.СуммаНДС    	 = ДокументСсылка.СуммаНДСДоставки;
					НоваяСтрокаД.Всего    	     = ДокументСсылка.СтоимостьДоставки;
				КонецЕсли;
				//--- Lazare_09.06.2021
				
			//Паганини_
			Иначе
				
				//1.
				Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
					ТаблицаПродаж = ПолучитьТаблицуПродаж(ДокументСсылка);
					Сумма_ТЧ  = 0;
					НДС_ТЧ    = 0;
					Всего_ТЧ  = 0;
					Для Каждого ТЗ Из ДокументСсылка.Запасы Цикл
						СтруктураПойска = Новый Структура("Номенклатура, Характеристика, Партия, СтавкаНДС", ТЗ.Номенклатура, ТЗ.Характеристика, ТЗ.Партия, ТЗ.СтавкаНДС);
						НоваяСтрока = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);
						НайденныеСтрокиПродаж 		= ТаблицаПродаж.НайтиСтроки(СтруктураПойска);
						Если НайденныеСтрокиПродаж.Количество() > 0 Тогда
							НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов = НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов - 1;
							Если НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов = 0 Тогда
								НоваяСтрока.Всего 		= НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить;
								НоваяСтрока.СуммаНДС 	= НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить;
								НоваяСтрока.Сумма 		= НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
							Иначе
								Коэффициент = ТЗ.Всего / НайденныеСтрокиПродаж[0].ИтогВсего;
								НоваяСтрока.Всего 		= Окр(НайденныеСтрокиПродаж[0].СуммаОборот		* Коэффициент, 2);
								НоваяСтрока.СуммаНДС 	= Окр(НайденныеСтрокиПродаж[0].СуммаНДСОборот	* Коэффициент, 2);
								НоваяСтрока.Сумма 		= НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
								
								НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить		= НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить	- НоваяСтрока.Всего;
								НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить	= НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить	- НоваяСтрока.СуммаНДС;
							КонецЕсли;
						Иначе
							НоваяСтрока.Всего 		= 0;
							НоваяСтрока.СуммаНДС 	= 0;
							НоваяСтрока.Сумма 		= 0;
						КонецЕсли;
						Всего_ТЧ  = Всего_ТЧ + НоваяСтрока.Всего;
						НДС_ТЧ    = НДС_ТЧ   + НоваяСтрока.СуммаНДС;
						Сумма_ТЧ  = Сумма_ТЧ + НоваяСтрока.Сумма;
						Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
							НоваяСтрока.Вид = -1; 
						Иначе
							НоваяСтрока.Вид = 1;
						КонецЕсли;
					КонецЦикла;
					
					//+++ Lazare_09.06.2021
					Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") 
						и ЗначениеЗаполнено(ДокументСсылка.НоменклатураДоставки) Тогда	
						ТаблицаПродаж = ПолучитьДанныеДоставки(ДокументСсылка,ДокументСсылка.НоменклатураДоставки);
						
						Если ТаблицаПродаж.Количество() > 0 Тогда
							Для каждого Стр Из ТаблицаПродаж Цикл									
								НоваяСтрокаД = ДанныеДоставки.Добавить();
								НоваяСтрокаД.Номенклатура 	 = Стр.Номенклатура;	
								НоваяСтрокаД.ЕдиницаИзмерения= Стр.Номенклатура.ЕдиницаИзмерения;
								НоваяСтрокаД.Количество 	 = Стр.КоличествоОборот;
								НоваяСтрокаД.Цена 			 = Стр.СуммаОборот + Стр.СуммаНДСОборот;
								НоваяСтрокаД.Сумма 			 = Стр.СуммаОборот ;					
								НоваяСтрокаД.СтавкаНДС		 = Стр.СтавкаНДС;
								НоваяСтрокаД.СуммаНДС    	 = Стр.СуммаНДСОборот;
								НоваяСтрокаД.Всего    	     = Стр.СуммаОборот + Стр.СуммаНДСОборот ;
							КонецЦикла; 
							Всего_ТЧ  = Всего_ТЧ + НоваяСтрокаД.Всего;
							НДС_ТЧ    = НДС_ТЧ   + НоваяСтрокаД.СуммаНДС;
							Сумма_ТЧ  = Сумма_ТЧ + НоваяСтрокаД.Сумма;		
						КонецЕсли;
					КонецЕсли;
					//--- Lazare_09.06.2021
					НайденныеСтроки = ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ДокументСсылка.Ссылка));
					НайденныеСтроки[0].Всего 				= Всего_ТЧ;
					НайденныеСтроки[0].СуммаНДС 			= НДС_ТЧ;
					НайденныеСтроки[0].СуммаДокумента 		= Сумма_ТЧ;
				КонецЕсли;
				
				//2.
				Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
					ТаблицаПродаж = ПолучитьТаблицуПродаж(ДокументСсылка, "Работы", Ложь);
					Сумма_ТЧ  = 0;
					НДС_ТЧ    = 0;
					Всего_ТЧ  = 0;
					Для Каждого ТЗ Из ДокументСсылка.Работы Цикл
						СтруктураПойска = Новый Структура("Номенклатура, Характеристика, СтавкаНДС", ТЗ.Номенклатура, ТЗ.Характеристика, ТЗ.СтавкаНДС);
						НоваяСтрока = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);
						НайденныеСтрокиПродаж 		= ТаблицаПродаж.НайтиСтроки(СтруктураПойска);
						Если НайденныеСтрокиПродаж.Количество() > 0 Тогда
							НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов = НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов - 1;
							Если НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов = 0 Тогда
								НоваяСтрока.Всего 		= НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить;
								НоваяСтрока.СуммаНДС 	= НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить;
								НоваяСтрока.Сумма 		= НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
							Иначе
								Коэффициент = ТЗ.Всего / НайденныеСтрокиПродаж[0].ИтогВсего;
								НоваяСтрока.Всего 		= Окр(НайденныеСтрокиПродаж[0].СуммаОборот		* Коэффициент, 2);
								НоваяСтрока.СуммаНДС 	= Окр(НайденныеСтрокиПродаж[0].СуммаНДСОборот	* Коэффициент, 2);
								НоваяСтрока.Сумма 		= НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
								
								НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить		= НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить	- НоваяСтрока.Всего;
								НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить	= НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить	- НоваяСтрока.СуммаНДС;
							КонецЕсли;
						Иначе
							НоваяСтрока.Всего 		= 0;
							НоваяСтрока.СуммаНДС 	= 0;
							НоваяСтрока.Сумма 		= 0;
						КонецЕсли;
						
						Всего_ТЧ  = Всего_ТЧ + НоваяСтрока.Всего;
						НДС_ТЧ    = НДС_ТЧ   + НоваяСтрока.СуммаНДС;
						Сумма_ТЧ  = Сумма_ТЧ + НоваяСтрока.Сумма;
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
						НоваяСтрока.Вид = 1;
					КонецЦикла;
					НайденныеСтроки = ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ДокументСсылка.Ссылка));
					НайденныеСтроки[0].Всего 				= Всего_ТЧ;
					НайденныеСтроки[0].СуммаНДС 			= НДС_ТЧ;
					НайденныеСтроки[0].СуммаДокумента 		= Сумма_ТЧ;
				КонецЕсли;
				
				//3.
				Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
					ТаблицаПродаж = ПолучитьТаблицуПродаж(ДокументСсылка, "РаботыИУслуги", Ложь);
					Сумма_ТЧ  = 0;
					НДС_ТЧ    = 0;
					Всего_ТЧ  = 0;
					Для Каждого ТЗ Из ДокументСсылка.РаботыИУслуги Цикл
						СтруктураПойска = Новый Структура("Номенклатура, Характеристика, СтавкаНДС", ТЗ.Номенклатура, ТЗ.Характеристика, ТЗ.СтавкаНДС);
						НоваяСтрока = Таблица.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ТЗ);
						НайденныеСтрокиПродаж 		= ТаблицаПродаж.НайтиСтроки(СтруктураПойска);
						Если НайденныеСтрокиПродаж.Количество() > 0 Тогда
							НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов = НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов - 1;
							Если НайденныеСтрокиПродаж[0].КоличествоСтрокЗапасов = 0 Тогда
								НоваяСтрока.Всего 		= НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить;
								НоваяСтрока.СуммаНДС 	= НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить;
								НоваяСтрока.Сумма 		= НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
							Иначе
								Коэффициент = ТЗ.Всего / НайденныеСтрокиПродаж[0].ИтогВсего;
								НоваяСтрока.Всего 		= Окр(НайденныеСтрокиПродаж[0].СуммаОборот		* Коэффициент, 2);
								НоваяСтрока.СуммаНДС 	= Окр(НайденныеСтрокиПродаж[0].СуммаНДСОборот	* Коэффициент, 2);
								НоваяСтрока.Сумма 		= НоваяСтрока.Всего - НоваяСтрока.СуммаНДС;
								
								НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить		= НайденныеСтрокиПродаж[0].СуммаОсталосьРаспределить	- НоваяСтрока.Всего;
								НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить	= НайденныеСтрокиПродаж[0].СуммаНДСОсталосьРаспределить	- НоваяСтрока.СуммаНДС;
							КонецЕсли;
						Иначе
							НоваяСтрока.Всего 		= 0;
							НоваяСтрока.СуммаНДС 	= 0;
							НоваяСтрока.Сумма 		= 0;
						КонецЕсли;
						Всего_ТЧ  = Всего_ТЧ + НоваяСтрока.Всего;
						НДС_ТЧ    = НДС_ТЧ   + НоваяСтрока.СуммаНДС;
						Сумма_ТЧ  = Сумма_ТЧ + НоваяСтрока.Сумма;
						НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаИзмерения;
						НоваяСтрока.Вид = 1;
					КонецЦикла;
					НайденныеСтроки = ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", ДокументСсылка.Ссылка));
					НайденныеСтроки[0].Всего 				= Всего_ТЧ;
					НайденныеСтроки[0].СуммаНДС 			= НДС_ТЧ;
					НайденныеСтроки[0].СуммаДокумента 		= Сумма_ТЧ;
				КонецЕсли;
			КонецЕсли;
			//_Паганини
		КонецЦикла;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Номенклатура,
		               |	Таблица.Характеристика,
		               |	Таблица.Количество,
		               |	Таблица.Цена,
		               |	Таблица.Сумма,
		               |	Таблица.СтавкаНДС,
		               |	Таблица.СуммаНДС,
		               |	Таблица.Всего,
		               |	Таблица.Вид,
		               |	Таблица.ЕдиницаИзмерения
		               |ПОМЕСТИТЬ Запасы
		               |ИЗ
		               |	&Таблица КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Запасы.Номенклатура,
		               |	Запасы.Характеристика,
		               |	Запасы.СтавкаНДС,
		               |	Сумма(Запасы.Количество * Запасы.вид) Как Количество ,
		               |	СУММА(Запасы.Всего * Запасы.Вид) / Сумма(Запасы.Количество * Запасы.вид) Как Цена,
		               |	СУММА(Запасы.СуммаНДС * Запасы.Вид) КАК СуммаНДС,
		               |	СУММА((Запасы.Всего - Запасы.СуммаНДС) * Запасы.Вид) КАК Сумма,
		               |	СУММА(Запасы.Всего * Запасы.Вид) КАК Всего,
		               |	Запасы.ЕдиницаИзмерения
		               |ИЗ
		               |	Запасы КАК Запасы
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Запасы.Номенклатура,
		               |	Запасы.Характеристика,
		               |	Запасы.Цена,
		               |	Запасы.СтавкаНДС,
		               |	Запасы.ЕдиницаИзмерения";
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Запасы.Очистить();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;	
		
		//+++ Lazare_09.06.2021
		//СтоимостьДоставки 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Таблица.Номенклатура,
		               |	Таблица.Количество,
		               |	Таблица.Цена,
		               |	Таблица.Сумма,
		               |	Таблица.СтавкаНДС,
		               |	Таблица.СуммаНДС,
		               |	Таблица.ЕдиницаИзмерения,
		               |	Таблица.Всего
		               |ПОМЕСТИТЬ Запасы
		               |ИЗ
		               |	&ДанныеДоставки КАК Таблица
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Запасы.Номенклатура,
		               |	Запасы.Количество,
		               |	Запасы.Цена,
		               |	Запасы.Сумма,
		               |	Запасы.СтавкаНДС,
		               |	Запасы.СуммаНДС,
		               |	Запасы.ЕдиницаИзмерения,
		               |	Запасы.Всего
		               |ИЗ
		               |	Запасы КАК Запасы";
					  		
		Запрос.УстановитьПараметр("ДанныеДоставки", ДанныеДоставки);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаД = Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаД, Выборка);
		КонецЦикла;
		//--- Lazare_09.06.2021
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьТаблицуПродаж(ДокументСсылка, ИмяТЗ = "Запасы", ЕстьРеквизитПартия = Истина)
	
	ЗапросПродаж = Новый Запрос;
	Если ЕстьРеквизитПартия Тогда
		ЗапросПродаж.Текст =
			"ВЫБРАТЬ
			|	ИмяТЗ.Номенклатура,
			|	ИмяТЗ.Характеристика,
			|	ИмяТЗ.Партия КАК Партия,
			|	ИмяТЗ.СтавкаНДС,
			|	ИмяТЗ.СуммаНДС,
			|	ИмяТЗ.Всего
			|ПОМЕСТИТЬ ВТ_ЗапасыДокумента
			|ИЗ
			|	&ИмяТЗ КАК ИмяТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ЗапасыДокумента.Номенклатура,
			|	ВТ_ЗапасыДокумента.Характеристика,
			|	ВТ_ЗапасыДокумента.Партия,
			|	ВТ_ЗапасыДокумента.СтавкаНДС,
			|	СУММА(ВТ_ЗапасыДокумента.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ВТ_ЗапасыДокумента.Всего) КАК Всего,
			|	СУММА(1) КАК КоличествоСтрокЗапасов
			|ПОМЕСТИТЬ ЗапасыСвенутая
			|ИЗ
			|	ВТ_ЗапасыДокумента КАК ВТ_ЗапасыДокумента
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ЗапасыДокумента.Номенклатура,
			|	ВТ_ЗапасыДокумента.Партия,
			|	ВТ_ЗапасыДокумента.Характеристика,
			|	ВТ_ЗапасыДокумента.СтавкаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПродажиОбороты.Номенклатура,
			|	ПродажиОбороты.Характеристика,
			|	ПродажиОбороты.Партия,
			|	ПродажиОбороты.СтавкаНДС,
			|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
			|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот,
			|	СУММА(ПродажиОбороты.СуммаНДСОборот) КАК СуммаНДСОборот
			|ПОМЕСТИТЬ Продажи
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(, , Регистратор, Документ = &ДокументСсылка) КАК ПродажиОбороты
			|ГДЕ
			|	ПродажиОбороты.Регистратор = &ДокументСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПродажиОбороты.Партия,
			|	ПродажиОбороты.Номенклатура,
			|	ПродажиОбороты.Характеристика,
			|	ПродажиОбороты.СтавкаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Продажи.Номенклатура,
			|	Продажи.Характеристика,
			|	Продажи.Партия,
			|	Продажи.СтавкаНДС,
			|	Продажи.КоличествоОборот,
			|	Продажи.СуммаОборот,
			|	Продажи.СуммаНДСОборот,
			|	ЗапасыСвенутая.СуммаНДС КАК ИтогСуммаНДС,
			|	ЗапасыСвенутая.Всего КАК ИтогВсего,
			|	ЗапасыСвенутая.КоличествоСтрокЗапасов,
			|	Продажи.СуммаОборот КАК СуммаОсталосьРаспределить,
			|	Продажи.СуммаНДСОборот КАК СуммаНДСОсталосьРаспределить
			|ИЗ
			|	Продажи КАК Продажи
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыСвенутая КАК ЗапасыСвенутая
			|		ПО Продажи.Номенклатура = ЗапасыСвенутая.Номенклатура
			|			И Продажи.Характеристика = ЗапасыСвенутая.Характеристика
			|			И Продажи.Партия = ЗапасыСвенутая.Партия
			|			И Продажи.СтавкаНДС = ЗапасыСвенутая.СтавкаНДС";
		ЗапросПродаж.УстановитьПараметр("ИмяТЗ", 			ДокументСсылка[ИмяТЗ].Выгрузить());
		ЗапросПродаж.УстановитьПараметр("ДокументСсылка", 	ДокументСсылка);
	Иначе
		ЗапросПродаж.Текст =
			"ВЫБРАТЬ
			|	ИмяТЗ.Номенклатура,
			|	ИмяТЗ.Характеристика,
			|	ИмяТЗ.СтавкаНДС,
			|	ИмяТЗ.СуммаНДС,
			|	ИмяТЗ.Всего
			|ПОМЕСТИТЬ ВТ_ЗапасыДокумента
			|ИЗ
			|	&ИмяТЗ КАК ИмяТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ЗапасыДокумента.Номенклатура,
			|	ВТ_ЗапасыДокумента.Характеристика,
			|	ВТ_ЗапасыДокумента.СтавкаНДС,
			|	СУММА(ВТ_ЗапасыДокумента.СуммаНДС) КАК СуммаНДС,
			|	СУММА(ВТ_ЗапасыДокумента.Всего) КАК Всего,
			|	СУММА(1) КАК КоличествоСтрокЗапасов
			|ПОМЕСТИТЬ ЗапасыСвенутая
			|ИЗ
			|	ВТ_ЗапасыДокумента КАК ВТ_ЗапасыДокумента
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_ЗапасыДокумента.Номенклатура,
			|	ВТ_ЗапасыДокумента.Характеристика,
			|	ВТ_ЗапасыДокумента.СтавкаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПродажиОбороты.Номенклатура,
			|	ПродажиОбороты.Характеристика,
			|	ПродажиОбороты.СтавкаНДС,
			|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
			|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот,
			|	СУММА(ПродажиОбороты.СуммаНДСОборот) КАК СуммаНДСОборот
			|ПОМЕСТИТЬ Продажи
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(, , Регистратор, Документ = &ДокументСсылка) КАК ПродажиОбороты
			|ГДЕ
			|	ПродажиОбороты.Регистратор = &ДокументСсылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ПродажиОбороты.Номенклатура,
			|	ПродажиОбороты.Характеристика,
			|	ПродажиОбороты.СтавкаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Продажи.Номенклатура,
			|	Продажи.Характеристика,
			|	Продажи.СтавкаНДС,
			|	Продажи.КоличествоОборот,
			|	Продажи.СуммаОборот,
			|	Продажи.СуммаНДСОборот,
			|	ЗапасыСвенутая.СуммаНДС КАК ИтогСуммаНДС,
			|	ЗапасыСвенутая.Всего КАК ИтогВсего,
			|	ЗапасыСвенутая.КоличествоСтрокЗапасов,
			|	Продажи.СуммаОборот КАК СуммаОсталосьРаспределить,
			|	Продажи.СуммаНДСОборот КАК СуммаНДСОсталосьРаспределить
			|ИЗ
			|	Продажи КАК Продажи
			|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыСвенутая КАК ЗапасыСвенутая
			|		ПО Продажи.Номенклатура = ЗапасыСвенутая.Номенклатура
			|			И Продажи.Характеристика = ЗапасыСвенутая.Характеристика
			|			И Продажи.СтавкаНДС = ЗапасыСвенутая.СтавкаНДС";
		ЗапросПродаж.УстановитьПараметр("ИмяТЗ", 			ДокументСсылка[ИмяТЗ].Выгрузить());
		ЗапросПродаж.УстановитьПараметр("ДокументСсылка", 	ДокументСсылка);
	КонецЕсли;
	Возврат ЗапросПродаж.Выполнить().Выгрузить();
	
КонецФункции

//+++ Lazare_09.06.2021
Функция ПолучитьДанныеДоставки(ДокументСсылка,Номенклатура)

	 ДанныеДоставки = Новый Запрос ;
	 ДанныеДоставки.Текст =  
	  "ВЫБРАТЬ
	  |	ПродажиОбороты.Номенклатура,
	  |	ПродажиОбороты.СтавкаНДС,
	  |	ПродажиОбороты.КоличествоОборот,
	  |	ПродажиОбороты.СуммаОборот,
	  |	ПродажиОбороты.СуммаНДСОборот
	  |ИЗ
	  |	РегистрНакопления.Продажи.Обороты(
	  |			,
	  |			,
	  |			Регистратор,
	  |			Документ = &Документ
	  |				И Номенклатура = &Номенклатура) КАК ПродажиОбороты";
	 
	  ДанныеДоставки.УстановитьПараметр("Документ",ДокументСсылка);
	  ДанныеДоставки.УстановитьПараметр("Номенклатура",Номенклатура);

	  
	  Возврат ДанныеДоставки.Выполнить().Выгрузить();

	  

КонецФункции
//--- Lazare_09.06.2021

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Аванс Тогда
		//ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Документ");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Договор");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.Сумма");
		ПроверяемыеРеквизиты.Добавить("ДокументыПлатежа.СуммаНДС");
	КонецЕсли;
	
	//Паганини#OneSoft_
	Если Корректировочная Тогда 
		ПроверяемыеРеквизиты.Добавить("ОснованиеКорректировки");
		ПроверяемыеРеквизиты.Добавить("СтатусКорректировочнойСчетФактуры");
	КонецЕсли;
	//_Паганини#OneSoft
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.СчетФактураОтправленныйГрузия.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьАвансыОтправленныхФактур(ДополнительныеСвойства, Движения, Отказ);
	Если ЗначениеЗаполнено(ВидНалога) Тогда // Kuzmich, 18.09.2019, Добавление бух проводок в счет фактурах
		УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);// Kuzmich, 16.09.2019, Добавление бух проводок в счет фактурах
	КонецЕсли;
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

//Паганини#OneSoft_
Процедура ЗаполнитьИзКорректировкиРеализации(ВыбранныеДокументы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(КорректировкаРеализацииЗапасы.НомерСтроки) КАК НомерСтроки,
		|	КорректировкаРеализацииЗапасы.Номенклатура,
		|	КорректировкаРеализацииЗапасы.Характеристика,
		|	СУММА(КорректировкаРеализацииЗапасы.Количество) КАК Количество,
		|	СУММА(КорректировкаРеализацииЗапасы.Цена) КАК Цена,
		|	СУММА(КорректировкаРеализацииЗапасы.Сумма) КАК Сумма,
		|	СУММА(КорректировкаРеализацииЗапасы.СуммаНДС) КАК СуммаНДС,
		|	СУММА(КорректировкаРеализацииЗапасы.Всего) КАК Всего,
		|	КорректировкаРеализацииЗапасы.СтавкаНДС,
		|	КорректировкаРеализацииЗапасы.ЕдиницаИзмерения
		|ИЗ
		|	Документ.КорректировкаРеализации.Запасы КАК КорректировкаРеализацииЗапасы
		|ГДЕ
		|	КорректировкаРеализацииЗапасы.Ссылка В(&ВыбранныеДокументы)
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииЗапасы.Характеристика,
		|	КорректировкаРеализацииЗапасы.Номенклатура,
		|	КорректировкаРеализацииЗапасы.СтавкаНДС,
		|	КорректировкаРеализацииЗапасы.ЕдиницаИзмерения
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	Запрос.УстановитьПараметр("ВыбранныеДокументы", ВыбранныеДокументы);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьИзПриходнаяНакладная(ВыбранныеДокументы) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ПриходнаяНакладнаяЗапасы.НомерСтроки) КАК НомерСтроки,
		|	ПриходнаяНакладнаяЗапасы.Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Характеристика,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Количество) КАК Количество,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Цена) КАК Цена,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Сумма) КАК Сумма,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Всего) КАК Всего,
		|	ПриходнаяНакладнаяЗапасы.СтавкаНДС,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТВозвраты
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка В(&ВыбранныеДокументы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяЗапасы.Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Характеристика,
		|	ПриходнаяНакладнаяЗапасы.СтавкаНДС,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(СчетФактураОтправленныйГрузияЗапасы.НомерСтроки) КАК НомерСтроки,
		|	СчетФактураОтправленныйГрузияЗапасы.Номенклатура КАК Номенклатура,
		|	СчетФактураОтправленныйГрузияЗапасы.Характеристика КАК Характеристика,
		|	СУММА(СчетФактураОтправленныйГрузияЗапасы.Количество) КАК Количество,
		|	СУММА(СчетФактураОтправленныйГрузияЗапасы.Цена) КАК Цена,
		|	СУММА(СчетФактураОтправленныйГрузияЗапасы.Сумма) КАК Сумма,
		|	СУММА(СчетФактураОтправленныйГрузияЗапасы.СуммаНДС) КАК СуммаНДС,
		|	СУММА(СчетФактураОтправленныйГрузияЗапасы.Всего) КАК Всего,
		|	СчетФактураОтправленныйГрузияЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	СчетФактураОтправленныйГрузияЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТРеализации
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.Запасы КАК СчетФактураОтправленныйГрузияЗапасы
		|ГДЕ
		|	СчетФактураОтправленныйГрузияЗапасы.Ссылка = &ОснованиеКорректировки
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураОтправленныйГрузияЗапасы.СтавкаНДС,
		|	СчетФактураОтправленныйГрузияЗапасы.Характеристика,
		|	СчетФактураОтправленныйГрузияЗапасы.Номенклатура,
		|	СчетФактураОтправленныйГрузияЗапасы.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРеализации.НомерСтроки,
		|	ВТРеализации.Номенклатура,
		|	ВТРеализации.Характеристика,
		|	ВТРеализации.Количество - ЕСТЬNULL(ВТВозвраты.Количество, 0) КАК Количество,
		|	ВТРеализации.Цена,
		|	ВТРеализации.Сумма - ЕСТЬNULL(ВТВозвраты.Сумма, 0) КАК Сумма,
		|	ВТРеализации.СуммаНДС - ЕСТЬNULL(ВТВозвраты.СуммаНДС, 0) КАК СуммаНДС,
		|	ВТРеализации.Всего - ЕСТЬNULL(ВТВозвраты.Всего, 0) КАК Всего,
		|	ВТРеализации.СтавкаНДС,
		|	ВТРеализации.ЕдиницаИзмерения
		|ИЗ
		|	ВТРеализации КАК ВТРеализации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВозвраты КАК ВТВозвраты
		|		ПО ВТРеализации.Номенклатура = ВТВозвраты.Номенклатура
		|			И ВТРеализации.Характеристика = ВТВозвраты.Характеристика
		|ГДЕ
		|	ВТРеализации.Количество - ЕСТЬNULL(ВТВозвраты.Количество, 0) > 0";
	Запрос.УстановитьПараметр("ОснованиеКорректировки", ОснованиеКорректировки);
	Запрос.УстановитьПараметр("ВыбранныеДокументы",		ВыбранныеДокументы);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;

КонецПроцедуры

Функция НайтиФактуруПоНакладной(Накладная)
	
	Если Не ЗначениеЗаполнено(Накладная) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетФактураОтправленныйГрузияДокументыОснования.Ссылка КАК СФ
		|ИЗ
		|	Документ.СчетФактураОтправленныйГрузия.ДокументыОснования КАК СчетФактураОтправленныйГрузияДокументыОснования
		|ГДЕ
		|	СчетФактураОтправленныйГрузияДокументыОснования.ДокументОснование = &Накладная
		|	И НЕ СчетФактураОтправленныйГрузияДокументыОснования.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Накладная", Накладная);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СФ;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции
//_Паганини#OneSoft
